<?php
require_once("../_functions.php");
// Если запрос идёт не из Ajax
if( $_SERVER['HTTP_X_REQUESTED_WITH'] != "XMLHttpRequest" )
{
    exit("Access denied!");
}
//-------------------------------------------------------------------------------------------------//
if($_SESSION['gryppa'] != md5('ekspert'.$sol_user_gryppa)){
    exit("Access denied!");
}
//-------------------------------------------------------------------------------------------------//
$fio=check_string($_GET['fio']);
$filtr_yroven_obrazov=check_number($_GET['filtr_yroven_obrazov']);
//-------------------------------------------------------------------------------------------------//
if($fio=='') $fio='';
if($filtr_yroven_obrazov=='') $filtr_yroven_obrazov=0;
//-------------------------------------------------------------------------------------------------//
if($fio==''){
    exit('Введите ФИО');
}
if($filtr_yroven_obrazov==0){
    exit('Выберите уровень образования');
}
//-------------------------------------------------------------------------------------------------//
//-------------------------------------------------------------------------------------------------//
//-------------------------------------------------------------------------------------------------//
$sql="SELECT id FROM tusers WHERE udln is null and md5(concat(id,'".$sol_user_id."')) = '".$_SESSION['user_id']."'";
$res = mysqli_query($db,$sql);
$line=mysqli_fetch_array($res,MYSQLI_NUM);
if($line[0]==''){
    exit("Не обнаружен 'user_id'");
}else{
    $user_id=$line[0];
}
//-------------------------------------------------------------------------------------------------//
//-------------------------------------------------------------------------------------------------//
//-------------------------------------------------------------------------------------------------//
//proverka vremeni nachala testirovaniya
$testirovanie_status = check_testirovanie_time()[0];
if($testirovanie_status == 10 || $testirovanie_status == 12){
    //10-testirovanie zaversheno
    //12-seichas testirovanie ne provoditsa
    exit("Тестирование в данный момент времени не проводится.");
}
//-------------------------------------------------------------------------------------------------//
//-------------------------------------------------------------------------------------------------//
//-------------------------------------------------------------------------------------------------//
$sql="SELECT id FROM teksperttest WHERE udln is null and id_user=$user_id";
$res = mysqli_query($db,$sql);
if($res->num_rows==0) {
    $sql = "INSERT INTO teksperttest(
            u_cr, d_cr, u_upd, d_upd,
            id_user, 
            test_time_start, test_time_end,
            fio, id_yroven_obrazov
            ) VALUES (
            '" . $_SESSION['user'] . "', now(), '" . $_SESSION['user'] . "', now(),
            $user_id,
            now(),null,            
            '" . $fio . "',$filtr_yroven_obrazov
            )";
    if(mysqli_query($db, $sql)!=true) exit('Неизвестная ошибка при сохранении данных (start)(добавление).');
}
//-------------------------------------------------------------------------------------------------//
//-------------------------------------------------------------------------------------------------//
?>